CFD-Computational Heat Transfer/03_OpenFOAM/Flow_Over_Cylinder/Re_150/Case_Setup/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       15;

stopAt          endTime;

endTime         30;

deltaT          1e-4;

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type        forceCoeffs;
        functionObjectLibs ("libforces.so");
        patches     (obstacle);
        rho         rhoInf;
        rhoInf      1;
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        CofR        (0 0 0);
        pitchAxis   (0 0 1);
        magUInf     1;
        lRef        0.05;
        Aref        1;

        writeControl timeStep;
        writeInterval 1;
        log true;
    }
}



// ************************************************************************* //
