CFD-Computational Heat Transfer/03_OpenFOAM/Flow_Over_Cylinder/Re_150/Case_Setup/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       107400;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       107490;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          660;
        startFace       107580;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          360;
        startFace       108240;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          108000;
        startFace       108600;
    }
)

// ************************************************************************* //
